#ifndef _DATETIME_H_
#define _DATETIME_H_

#include "config.h"

#include "pcf8563.h"
#include "pcf8583.h"

/************************************************************************/
/* Получает текущее время                                               */
/************************************************************************/
void TimeInit();

/**
 * Возвращает текущие дату и время
 */
datetime_t* GetDateTime();


/**
 * Инкрементирует время на 0.01 секунду
 */
void DateTimeTick100();

/**
 * Возвращает количество дней в месяце
 */
uint8_t GetDaysPerMonth(datetime_t *dt);

/************************************************************************/
/* Сбрасывает текущее время                                             */
/* используется для отображения часов на экранах загрузки и сохранения  */
/************************************************************************/
void TimeReset();


#endif	// _DATETIME_H_